Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Ghost King.tmx
Source language: ko_kr
Languages: en_us

source: 윽사맹이 나한테 무슨 짓을 저질렀나' 겠죠.
en_us: do you mean, “what did the black death sect do to me?”

source: 아아아아
en_us: arghhh

source: 슈슈슛
en_us: swish swish

source: 선배님~ 실은 태연이가ꞏꞏꞏ
en_us: seonbae, did you know that taeyeon has a...

source: 정과 신은 한 곳으로 흐른다.
en_us: your mind and your body converge to the same place.

source: 글쎄 빌렸던 흑마서고의 흡성대법을 완성했나 싶었더니,
en_us: I was hoping to complete the fundamental qi absorption technique from the black demon book i’ve been borrowing.

source: 허억
en_us: huff

source: 순대국
en_us: korean sausage noodles

source: 구급차 불러줄까?
en_us: should I call you an ambulance?

source: 됐다ꞏꞏꞏ!
en_us: I did it...!

source: 크아아아아압!
en_us: hyaaah!

source: 주제도 모르고 은혜를 원수로 갚다니···
en_us: how dare you forget your place and bite the hand that fed you…?

source: 게다가 왠지 더 불어난 느낌이ꞏꞏꞏ
en_us: it actually seems like there’s even more now...

source: 그렇게 생각했는데ꞏꞏꞏ
en_us: that’s what I thought...

source: 쿠 아
en_us: shout

source: 청춘이라ꞏꞏꞏ
en_us: oh, youth...

source: 좋아!
en_us: all right!

source: 빠{j}악
en_us: wham{j}

source: 퍽퍽
en_us: whack

source: 속세에 관여하는 건 본교의 가르침에 위배되지만···
en_us: as much as getting involved with the world goes against our school’s teachings…

source: 오
en_us: oh

source: 한 대 맞으면 다섯 대 때린다!
en_us: if you get struck once, hit them back five times!

source: 이러니 저러니 해도 4대호법이란 말인가···
en_us: I guess she’s really one of the four great guardians…

source: 학
en_us: huff

source: 뭐해 머저리들아,
en_us: what are you doing, you fools?

source: 여기 메뉴에서 보시고 주문하시면···
en_us: if you take a look at the menu here, and…

source: 파다다닷
en_us: swish swish swish swish

source: 더는 안 되겠어,
en_us: this can’t go on any longer.

source: 휘이잉
en_us: whoosh

source: 뭣이?!
en_us: what?!

source: 아직도 그런 소릴 하는 건가?
en_us: are you still going on about that?

source: 쓰레기에 발이 달린 것도 아니고, 이게 어떻게 된 거지?
en_us: it’s not like it has a mind of its own! what’s going on?

source: 무경단 전속 병원
en_us: murim patrol squad private hospital

source: 띵ㅡ
en_us: ding

source: 소비스펙트럼에 대한 분석
en_us: analysis of spending spectrum

source: 몸이 가볍다?
en_us: why does my body feel so light?

source: 그것이 진정한 귀령의 힘인가···
en_us: is that the true power of the ghost king…?

source: 너ꞏꞏꞏ
en_us: you...

source: 네가 지금 당장은 귀령에게서 주도권을 가져왔을진 몰라도 안심하기엔 아직 일러.
en_us: you might’ve taken back control from the ghost king for now, but it’s too early to be relieved.

source: 지, 지호 선배?
en_us: j-jiho seonbae?

source: 후다다
en_us: jump

source: 아버지에게 추한 꼴을 보이고 말았어ꞏꞏꞏ
en_us: I let my father down...

source: 아아···
en_us: ahh…

source: 언제 맞은 거지?!
en_us: when did he hit me?!

source: 주변의 모든 생명을 도륙 낸 후에나 끝나는 마샴바의 분노를 막아내다니···
en_us: she managed to block mashamba, whose wrath only ceases after he’s massacred everyone in the vicinity…

source: 어떻게해서든 네 아비로부터 살아남아야만 해.
en_us: you must survive your father’s wrath no matter what.

source: 그래, 쫄보 X끼야!
en_us: yeah, you f*cking coward!

source: 이박 DANCE 교 실
en_us: lee park dance studio

source: 탁탁탁
en_us: step step step

source: 영구야~
en_us: hey, yeong-gu!

source: 이런 상태로 만들려면 무공이 아니고선 불가능해.
en_us: it’s impossible to do this to a person without martial arts.

source: 전륜법궁에서 나섰다면 진짜 귀령왕이 나타났다는 말인데···
en_us: if the revolution palace has taken action, that means the true ghost king has emerged…

source: 이걸 대체 어떻게 한꺼번에 모아ꞏꞏꞏ
en_us: how am I supposed to collect all of this at once...?

source: 아빠에 대한 단서를 찾을 수 있을 것 같아서.
en_us: ...that I’d be able to find some clues about him here.

source: 뿍
en_us: shoop

source: 흑마공 10성
en_us: 10th star of the black demon art

source: 결국 수많은 살인을 저지른 제자는 전륜법왕의 손에 명을 마감하였으나
en_us: in the end, the disciple, who had committed countless murders, died at the hands of the king of the revolution palace.

source: 반드시!
en_us: ...a monster!

source: 촤아악
en_us: skiiid

source: 제물이 필요했었군···
en_us: ...was a sacrifice…

source: 단 하나도 통하지 않았다.
en_us: ...but nothing i’d learned worked against him.

source: 그렇습니다.
en_us: that’s right.

source: 어억?!
en_us: huh?!

source: 당신한테 발톱 때만큼도 은혜를 받았다 생각한 적 없다.
en_us: not once in my life have I ever felt grateful to you.

source: 컥ꞏꞏꞏ!
en_us: argh...!

source: 뭐, 뭐야 이건?!
en_us: wh-what the heck?!

source: 겨우 그 정도 맞은 거로 나가떨어지면 안되지!
en_us: you shouldn’t pass out from a little thing like that!

source: 호법이란 놈이 조잡한 기계 따위에 의지하다니,
en_us: how can someone who calls himself a guardian use such a crude machine?

source: 진천순대국
en_us: jincheon-style korean sausage noodles

source: 하, X끼ꞏꞏꞏ
en_us: ha, bastard...

source: 기를 써볼까?
en_us: should I try using qi?

source: 뿌드득
en_us: grit

source: 빨리 찾아!
en_us: after him!

source: 어, 나다.
en_us: yeah, it’s me.

source: 무경대로 간다.
en_us: we’re going to murim police university.

source: 방금 저게 강태연이라고?
en_us: that was taeyeon?

source: 누가 좀 막아봐!
en_us: someone, stop it!

source: 개꿀~
en_us: score!

source: 선의 기운도 악의 기운도 올바른 길로 향하는 의지가 있다면
en_us: if you have the will to go down the right path, both good and evil energy...

source: 받아들여.
en_us: face it.

source: 답답한 놈.
en_us: kid, you’re giving me a headache.

source: 어이, 괜찮은가?
en_us: hey, are you all right?

source: 지잉
en_us: throb

source: 그것을 위해서라도 나는 이 힘을 완전히 내 것으로 만들겠다.
en_us: to that end, I’ll make this power completely my own.

source: 이건 싸움이라기 보단 오히려···
en_us: this isn’t a fight. rather, it’s…

source: 활 짝
en_us: beam

source: 옴 마니 반메 훔!!
en_us: om mani padme hum!!!

source: 혹시 빠르게 넣어야 하나?!
en_us: do I have to sweep faster?!

source: 나 그냥 갈게.
en_us: I’ll just go.

source: 어디서 때리는 건지 전혀 모르겠ꞏꞏꞏ
en_us: I can’t tell where he’s hitting from at all...

source: 할아버지, 이걸로 내가 이겼어!
en_us: i’ve won, grandpa!

source: 나선화
en_us: seonhwa na

source: 노 래 방
en_us: karaoke

source: 그대가 모든 것을 멸하기 전에!
en_us: before you destroy everything...!

source: 파
en_us: wave

source: 그런 거 모른다고!
en_us: I don’t know what you’re talking about!

source: 글쎄···
en_us: who knows…

source: 다련타뢰
en_us: many lotus strike

source: 덕분에 명분이 생겼다.
en_us: they gave me an excuse.

source: 윽
en_us: ugh

source: 어떻게 된 거지?
en_us: what’s going on?

source: 자그락
en_us: adjust

source: 만나서 반갑다.
en_us: nice to meet you,

source: 사파 최대의 문파가 이런 꼴을 보여서야···
en_us: how could the greatest sect of the evil faction be in such a sorry state…?

source: 니가 어떤 뭘 하던 쓰레기 무공의 끄나풀일 뿐이다!
en_us: whatever you do, your martial arts are nothing but trash!

source: 할아버지···?
en_us: grandpa…?

source: 빠 악
en_us: wham

source: 하지만 니 꼬라지를 보니 내 생각이 옳았다는 게 증명이 됐다!
en_us: but seeing you confirmed what i’ve been thinking!

source: 넌 오늘 죽었어.
en_us: you’re dead.

source: 몸으로 느끼는 게야.
en_us: you need to feel your opponent’s movements

source: 흑마왕님께서 원하신다ꞏꞏꞏ
en_us: ...and our very own black demon king wants him...

source: 그럼 말 좀 해주세요!
en_us: then please tell me about him!

source: 살인을 위한 살인···!
en_us: murder for murder’s sake…!

source: 하고 말이야.
en_us: to have become such a legend.

source: 이야~ 아직도 일어날 기운이 남았냐?
en_us: wow, you still have the strength to stand up?

source: 뭐야 얘, 구령옥을 어떻게···
en_us: what the heck? how does she know about the ghost jade…

source: 이렇게!
en_us: like this!

source: 니 친구도 빨리 보여달라고 떼를 쓰잖아~?
en_us: can’t you see your friend is begging you to show me?

source: 영상 / 음향 분석
en_us: image / sound analysis

source: 마샴바.
en_us: mashamba.

source: 어제ꞏꞏꞏ
en_us: yesterday...

source: 살수문의 애송이,
en_us: you, greenhorn from the assassin sect.

source: 유투브에 귀령파같은 비기를 올리는 생각 없는 놈인 줄 알았는데ꞏꞏꞏ
en_us: and here i thought he was just some blockhead who uploaded secret techniques like the ghostly spirit wave to youtube...

source: 뒈져라.
en_us: die.

source: 서, 선배···
en_us: s-seonbae…

source: 콰창
en_us: snap

source: 잘 부탁해요 ㅎㅎ
en_us: i hope we can get along, hehe

source: 수금한 돈도 바닥났는데 ㅆ···
en_us: sh*t, and we’ve run out of the money we collected, too…

source: 타{j}탓
en_us: dash

source: 액
en_us: oosh

source: 배이나
en_us: ina bae

source: 컥
en_us: cough

source: 사장님의 신체는 금강불괴의 극의 그 자체ꞏꞏꞏ
en_us: the chairman is nearly indestructible...

source: 귀령의 기운···
en_us: shall I teach you…

source: 만약 아버지의 뜻을 따라 계속 갔더라면ꞏꞏꞏ
en_us: if only I’d listened to my father...

source: 나, 강태연을!
en_us: me, taeyeon kang!

source: 저, 저건 흑마서고!?
en_us: th-that’s the black demon book?!

source: 일어나보니 왠 이상한 여자가 절 만지고ꞏꞏꞏ
en_us: I woke up to this strange woman touching me...

source: 어쭈···
en_us: well…

source: 업그레이드 귀령파다!
en_us: upgraded ghostly spirit wave!

source: 아무리 봐도 내용이 빠져있아.
en_us: but some of the information is missing.

source: 다행히 반로환동한 내 모습을 못 알아보는 것 같은데ꞏꞏꞏ
en_us: thankfully, he doesn’t seem to recognize me after my rejuvenation...

source: 말도 안 돼ꞏꞏꞏ
en_us: no way...

source: 확실해, 놈의 분위기가 변했다ꞏꞏꞏ
en_us: there’s no doubt about it... something’s changed...

source: 한 달 전
en_us: one month ago

source: 아니, 그러니까 뭔가 힌트를ꞏꞏꞏ
en_us: wait, give me a hint...

source: 수고들 했으니 이만 물러가도록.
en_us: thank you for your hard work. you may go now.

source: 아니, 왜 자꾸 할아버지가 이기는거야?
en_us: how do you keep winning every round, grandpa?

source: 내가 가르쳐준다니까, 귀령의
en_us: I said i’ll teach you the ghost king’s…

source: 두{j}웅
en_us: da dun

source: 토르카, 정말 갈 거야?
en_us: torka, is it true that you’re leaving?

source: 도와드리면 되잖아요.
en_us: I’ll help, okay?

source: 넌 그저 겉만 번지르르한 쓰레기 조상의 애X끼다.
en_us: you’re only a brat descended from a flashy piece of trash.

source: 할아버지 무공은 되도록 쓰지 말 것, 누가 네 무공에 대해 캐내려 한다면 무조건 자릴 피해라.
en_us: First, avoid using your grandfather's martial arts. If anyone tries to find out more about your techniques, run.

source: 으아아아악
en_us: arghhh

source: 알게 뭐예요, 그런 줏대 없는 놈···
en_us: who cares about that spineless bastard…

source: 화산은 화산으로서 존재한다며,
en_us: he said that the flower mountain exists for itself.

source: 다른 메뉴는 뭐가 있지?
en_us: what else is on the menu?

source: XX골목 지하주차장
en_us: xx alley underground parking lot

source: 너, 강태연이랑 친하다며?
en_us: I hear you’re friends with taeyeon kang.

source: 어쩌다가 이렇게 된 거지?
en_us: how did things come to this?

source: 쩌{j}엉
en_us: fwoosh

source: 안돼, 그만해!
en_us: no, stop!

source: 사실 너한테 기대를 좀 했어.
en_us: to be honest, I had high hopes for you.

source: 쿠오오오오
en_us: rumble

source: 여기서 어떻게 하지···?
en_us: what should I do now…?

source: 왜 아무것도 안 보이는 거지?
en_us: why can’t I see anything?

source: 이대로 그냥 가면 나의 가르침을 잊을 수도 있으니ꞏꞏꞏ
en_us: ...since you might forget my teachings if let you go like this...

source: 그림 박진석
en_us: art by jinseok park

source: 이 힘을 제어할 수 있다면···
en_us: ...just the tiniest bit of this power…

source: 이제 곧 완성된다···
en_us: soon, it’ll be complete…

source: 글쎄, 과연 누가 깨뜨릴 수 있을까ꞏꞏꞏ
en_us: and who could possibly break this peace, i wonder...

source: 까, 까칠하다···
en_us: s-she’s so on edge…

source: 콰오
en_us: charge

source: 미안, 나는 네 식탐을 도저히 감당할 수가···
en_us: I’m sorry but I can’t handle your appetite…

source: 가야지
en_us: yes.

source: 어머니, 어째서···
en_us: mother, why…

source: 카득
en_us: pop

source: 홍툰
en_us: hong toon

source: 설마, 저 아저씨가 이상한 술수를ꞏꞏꞏ?
en_us: did that guy do something...?

source: 활
en_us: be

source: 살기ꞏꞏꞏ!
en_us: this is bloodthirst...!

source: 억
en_us: ack

source: 투앙
en_us: bwoom

source: 쩌적
en_us: crack

source: 주르륵
en_us: slump

source: 이ㅅ끼, 얼마나 처먹으려고···!
en_us: how much more is this darn pig gonna eat…?!

source: 훙훙훙훙
en_us: whoosh

source: 이상한 여자라니 말이 너무 심하네~
en_us: strange woman? don’t you think that’s a little harsh?

source: 라면 먹자.
en_us: let’s have some instant noodles.

source: 진 호법에게 전해라.
en_us: pass on a message to guardian jin for me.

source: 흑마왕 주나선
en_us: black demon king, naseon ju

source: 수 북
en_us: heap

source: 촤 아
en_us: shaaa

source: 그래서 기를 쓰는 효율이 없었던 거야!
en_us: that’s what made it so inefficient!

source: 카카칵
en_us: swish swish

source: 사파 온갖 무학이 잠든 최대의 서고
en_us: ...the greatest library, containing all kinds of martial arts knowledge from the evil faction...

source: 멈추시오 그대여!
en_us: please stop!

source: 크윽, 긁히는 것만으로도 상처가ꞏꞏꞏ!
en_us: ugh, even the slightest scratch is leaving a wound...!

source: 저 컴퓨터?라고 부르는 상자의 메뉴가 전부인가?
en_us: is the only menu the one on that box you call a computer?

source: 흑마공 암기 3장 1절'
en_us: black demon art hidden technique chapter 3, verse 1

source: 휴
en_us: phew

source: 쐐
en_us: sw

source: 귀령왕
en_us: ghost king

source: 싫어!
en_us: no!

source: 힌트 좀 주세요!
en_us: please give me a hint!

source: 이정도면 이유가 되지 않을까?
en_us: wouldn’t you say this is enough reason?

source: 살수문에 맡기고 신경 끄고 있었는데,
en_us: I’d forgotten about him after i told the assassin sect to handle it...

source: 힌트라도 좀 제대로 줄 것이지!
en_us: he could’ve at least given me a proper hint!

source: 걱정하지 마십시오!
en_us: don’t worry!

source: 쿠직 뻑
en_us: crack

source: 쿠쿵
en_us: thump

source: 낄낄낄
en_us: hehehe

source: 살아남거라.
en_us: live on.

source: 너무 무서웠어요!
en_us: I was so scared!

source: 어디냐?
en_us: where are you?

source: 정말 고맙네.
en_us: ...for saving my son.

source: 얘만큼 귀령을 잘 아는 자는 할아버지 외에는 없었다.
en_us: no one knows more about the ghost than her except for grandpa.

source: 너, 방금 귀령파가 별로 효과가 없다고 생각했지?
en_us: you were just thinking the ghostly spirit wave wasn’t effective, weren’t you?

source: 내가 흑마서고를 빼돌렸다는 사실이 대호법 유재호, 그에게 발각된다면···
en_us: if the great guardian jaeho yu were to know that I stole the black demon book…

source: 하지만 느려!
en_us: but you’re too slow!

source: 네가 지금부터 가려는 곳은 자살하러 가는 거랑 다름없어.
en_us: the path you’ve chosen will lead to your death.

source: 휘오오오
en_us: fwoosh

source: 걱정돼서 온 건데 기우였네,
en_us: I came because I was worried, but I guess there was no need.

source: 유지호
en_us: jaeho yu

source: 장난 아니었지, 이상한 무기를 쓰는 그놈들ꞏꞏꞏ
en_us: those people armed with strange weapons weren’t joking around...

source: 맞는 말이다.
en_us: she’s right.

source: 뭐야, 벌써 뻗은 거냐?
en_us: what, you’ve had enough already?

source: 형님이 PC방에서 그렇게 처먹으니까 숙소는커녕 밥 먹을 돈도 떨어졌어!
en_us: we don’t have money to sleep at an inn, let alone eat, because you blew it all on food at the internet cafe!

source: 명 품 마 사 지
en_us: luxury massage

source: 조금이라도 스치면 골로 가겠군···
en_us: looks like i’m dead if i even get grazed by that…

source: 흑사맹 사대호법 진용범 자택
en_us: four great guardians of the black death sect yongbeom jin’s residence

source: 촤아아아
en_us: skiiid

source: 넌 살수문의 자격이 없다.
en_us: you’re unfit to be part of the assassin sect.

source: 목표?
en_us: my goal?

source: 어줍잖은 정의를 향하는 너의 무공과는!
en_us: I’m not like your martial arts with its ridiculous sense of justice!

source: 크크크, 내 이럴 줄 알았어ꞏꞏꞏ
en_us: Keke, I knew it...

source: 크아!!
en_us: argh!!!

source: 사장님!
en_us: President!

source: 너 이ㅅ끼···!
en_us: you son of a b*tch…!

source: 서로 합이 잘 맞는 편이 좋잖아요~
en_us: after all, it’s better to pair up with someone you have chemistry with.

source: 방금 아저씨 뭐라고 했어요?
en_us: mister, what were you just saying?

source: 괴물이 되어서라도,
en_us: even if I become...

source: 저자는 어째서 마샴바에 빙의된 자를 가지고 놀 수 있었거지?
en_us: how is that girl able to play around with one who has been possessed by mashamba?

source: 언제부터 말대꾸하는 버릇이 생겼지?
en_us: when did you pick up the habit of talking back to me?

source: ㅈ나 힘들다···!
en_us: this is f*cking hard…!

source: 좀 받아!!
en_us: pick up!!!

source: 너 같은 놈은 귀령파를 보여줄 필요도 없어!
en_us: I don’t even need the ghostly spirit wave to take down small fry like you!

source: 이 이상 귀령의 힘을 써서는 안돼!
en_us: I can’t use the ghost king’s power anymore!

source: 꼬라지 봐라, 어디서 한바탕 하셨냐?
en_us: look at the state he’s in. did he get into a fight somewhere?

source: 마음을 꺽어버리면 어떤 반응을 보일까 궁금했는데···
en_us: I was wondering how she’d react if I broke her heart…

source: 큭큭큭큭큭
en_us: mwahahaha

source: 크읏!
en_us: urgh!

source: 놈은 가면을 쓰고 있었다.
en_us: he was wearing a mask.

source: 내가 왜 정체도 모르는 X끼한테 그걸 보여줘야 하지?
en_us: why the hell should I? I don’t even know you.

source: 게다가 저 남자ꞏꞏꞏ
en_us: and this man...

source: 저건···!
en_us: that’s…!

source: 흉흉한 기가 소름이 끼치는군,
en_us: its stormy qi gives me goosebumps.

source: 버억
en_us: gobble

source: 두
en_us: d

source: 하지만 나 역시···
en_us: but I’m not…

source: 소멸만이 살겁을 막는 유일한 길···
en_us: the only way to prevent further killing is to destroy him…

source: 내가 대체하겠다!
en_us: I’m going to replace you!

source: 이런 놈은 죽어도 싸지ꞏꞏꞏ
en_us: he deserves to die...

source: 쐐{j}액
en_us: swoosh{j}

source: 이런 말도 안 되는ꞏꞏꞏ
en_us: impossible...

source: 태ꞏꞏꞏ연ꞏꞏꞏ
en_us: tae... yeon...

source: 한 발짝이라도 더···
en_us: I need to get one step closer…

source: 은혜를 원수라···
en_us: biting the hand that feeds, huh…

source: 범촌기원
en_us: baduk academy

source: 츄아아아
en_us: shaaa

source: 어떤 성질급한 손님이 나 대신 본산을 청소해준 덕분에 큰 걸림돌이 하나 사라졌어.
en_us: a huge obstacle has disappeared thanks to some impatient guest who cleaned up the main base ahead of me.

source: 넌 뭐야?
en_us: what’s your problem?

source: 언젠가···
en_us: even if…

source: 약속을 지키기 바람 흑마서고를 입수
en_us: expect you to keep your promise. obtained the black demon book.

source: 쿠
en_us: wh

source: 낭안을 사용해도 너무 흐릿하군···
en_us: it’s hard to see even with wolf eyes…

source: 괴, 괴물들이다!
en_us: th-they’re monsters!

source: 흑사우주'를 개방한 나에게 간격이란 무의미해.
en_us: ...now that i’ve unfurled the red wings of the black snake.

source: 받아라ꞏꞏꞏ
en_us: take this...!

source: 아이 씨, 알았어요!
en_us: ugh, fine!

source: 전륜법궁
en_us: revolution palace

source: 아버지에게 추한 꼴을 보이고 말았어···
en_us: I let my father down...

source: 스으윽
en_us: swoosh

source: 이자식, 팔을 꼬았어ꞏꞏꞏ?
en_us: did this bastard just twist my arms...?

source: 아까처럼 부서지지 않아, 성공이다!
en_us: it’s not falling apart like before. I did it!

source: 방주님, 지금 잠깐 와보셔야겠습니다.
en_us: master, we need you here for a minute.

source: 이 자식, 설마 동귀어진의 수를···!
en_us: don’t tell me she’s gonna use the suicidal technique…?!

source: 과연.
en_us: i wonder...

source: 혹시 우리가 쫓던 그놈일까요?
en_us: could it be the same guy we were chasing?

source: 29화
en_us: episode 29

source: 흑, 바닥이ꞏꞏꞏ!
en_us: ugh, the ground...!

source: 어?
en_us: huh?

source: 그것은 저주일 뿐이다.
en_us: my strength is just a curse if I can’t control it.

source: 손을 좀 봐줘야겠어!
en_us: I should help him out!

source: 잘 모르겠다ꞏꞏꞏ
en_us: ...I’m not so sure...

source: 드드드드드
en_us: whoosh

source: 화, 확실합니까?
en_us: a-are you sure?

source: 어째서 강태연이···?
en_us: how is taeyeon kang doing it…?

source: 감히,
en_us: how dare you...

source: 달칵
en_us: flip

source: 치
en_us: tsk

source: 탑
en_us: tup

source: 이 기분, 느껴본 적 있다ꞏꞏꞏ
en_us: I recognize this feeling...

source: 형님, 토야가 눈앞에 있어요, 이럴 줄 알았으면 고백 받아줄 걸···
en_us: hyeong, toya is here. I would’ve accepted her confession if I knew this was gonna happen…

source: 이건 그저···
en_us: this is…

source: 사장님께 진 호법이라 부를 수 있는 자는 오직 그분뿐ꞏꞏꞏ
en_us: there’s only one person who can call the president guardian jin...

source: 화들짝
en_us: shocked

source: 어디서 맞고 다니니?
en_us: where have you been getting beat up at?

source: 기, 기적이를ꞏꞏꞏ
en_us: g-gijeok...

source: 기다려라 강태연.
en_us: just you wait, taeyeon kang.

source: 너가 그렇게 멍 때리고 있으니까ꞏꞏꞏ
en_us: it’s because you keep zoning out like that...

source: 똥 밟은 거 같은데 그냥 가자···
en_us: he must’ve stepped on turd or something. let’s just go…

source: 회.
en_us: re

source: 조, 조금만 더 모으면ꞏꞏꞏ!
en_us: j-just a little...!

source: 아직도 개방은 무림맹에 다시 들어올 생각이 없나?
en_us: do you still have no intention of rejoining the murim alliance?

source: 부 광 미 싱
en_us: bugwang tailor shop

source: 언제까지 맞고만 있을 생각이지?
en_us: how long are you going to take this one-sided beating?

source: 나가주라.
en_us: please leave me.

source: 으아아악!
en_us: argh!

source: 이, 이놈은ꞏꞏꞏ!
en_us: th-that’s...!

source: 타 앗
en_us: whoosh

source: ㅋㅋ
en_us: hehe

source: 기를 쓰면 잘 뭉쳐지는 구나!
en_us: they clump together if I use qi!

source: 이자식, 어떻게 귀령파를 맞고도ꞏꞏꞏ
en_us: How is that jerk still standing after a direct hit with the ghostly spirit wave...?

source: 뭐, 뭔 소리야?
en_us: wh-what’s that noise?

source: 타락한 마샴바가 이리도 무력하게···
en_us: how could the fallen mashamba be defeated so easily…?

source: 그러고 보니 미심쩍은 게 한 두 가지가 아냐ꞏꞏꞏ
en_us: come to think of it, this is all a bit fishy...

source: 무당의 영류검!
en_us: ...was definitely the wudang’s shadow stream sword!

source: 큭큭, 풋내기들이 제 명에 못 사는 이유가 이런 거지.
en_us: keke, this is why newbies like you don’t live long.

source: 뭐야, 어디갔어?
en_us: where did he go?

source: 아, 아 네.{j}그러니까ꞏꞏꞏ
en_us: o-oh, yes.{j}uh...

source: 이 자식, 여전히 날카롭다!
en_us: this guy is as sharp as always!

source: 서신인가···
en_us: a letter…

source: 형님, 그만 일어나시죠···
en_us: hyeong, we should really get going…

source: 압도적인 외공 앞에서는 그 어떤 것도 무의미해!
en_us: everything is meaningless in the face of physical power!

source: 허접이구만.
en_us: you’re just lousy.

source: 너는···
en_us: you’re…

source: 살수문 부문
en_us: assassin sect vice sect leader

source: 그렇다면 어쩔 것인가?
en_us: so what if I am?

source: 아악 뼈 맞았억, 어떤 쉐키가ꞏꞏꞏ
en_us: argh, who the hell did that?! you hit the bone...!

source: 크아아압!
en_us: argh!

source: 기, 기적아ꞏꞏꞏ?
en_us: g-gijeok...?

source: 너 이ㅅ끼, 설마···!
en_us: how dare you, you son of a b*tch…!

source: ㅅ발 왜 하나밖에 안 남았냐?
en_us: sh*t, why is there only one left?

source: 지금 거의 다 왔으니까.
en_us: I’m almost there.

source: 붕 붕 해 장 국
en_us: boong boong hangover soup

source: 설마, 저놈 때문에?···
en_us: don’t tell me it’s because of him…?

source: 아, 그건 미안하게 됐습니다.
en_us: ah, I’m sorry about that.

source: 나도 많이 늙었어···
en_us: I’m getting old…

source: 묻는 말에나 대답해라.
en_us: just tell me what i want to know.

source: 불끈
en_us: roar

source: 오랜만이군 홍 방주.
en_us: it’s been a while, master hong.

source: 귀령의 힘이 저주받은 것이라 해도 나의 것이다.
en_us: even if the ghost king’s powers are cursed, they’re mine.

source: 퍼버버버벅
en_us: thwack thwack wham

source: 투투툭
en_us: poke poke poke

source: 대호법께서 오실 때 까지 버티는 거다!
en_us: hold out until the great guardian arrives!

source: 근데, 설마 그거 하나 믿고 나불댄 건 아니겠지?
en_us: but surely you weren’t shooting your mouth off thinking that would be enough?

source: 토야, 다이어트 성공했구나···
en_us: toya, you’ve succeeded in your diet…

source: 그 가면 자식을 상대하던 중 귀령에 침식된 나는 통제를 잃고 날뛰기 시작했다.
en_us: while fighting with the masked guy, I was consumed by the ghost king and i lost control.

source: 뭐, 뭐야 이거ꞏꞏꞏ
en_us: wh-what the heck...

source: 기다려보ꞏꞏꞏ
en_us: I said, wait...

source: 귀령파도 안 통하는 저놈을 어떻게 해야ꞏꞏꞏ
en_us: how am I supposed to beat this guy when the ghostly spirit wave isn’t working...?

source: 콰아아아
en_us: whoosh

source: 알다시피 난 화산파 장문인의 아들이야.
en_us: as you can see, I’m the son of the leader of the flower mountain sect.

source: 이 기 적
en_us: gijeok lee

source: 네 말만 믿고 오긴 했다만,
en_us: I know I trusted you and came here,

source: 차르르
en_us: rattle

source: 내가 당신의 더러운 가면을 어떻게 벗겨낼지···
en_us: I’ll remove that filthy mask of yours…

source: 슈우우우
en_us: swirl

source: 슈슈슈슈
en_us: swish swish swish

source: 콰콰
en_us: rattle

source: 왜 자꾸 따라와?
en_us: why do you keep following me?

source: 니가 그토록 원하던ꞏꞏꞏ
en_us: ‘cause here comes that ghostly spirit wave...

source: 역시 젊은게 좋다니까.
en_us: being young sure is nice.

source: 하지만···
en_us: however…

source: 장문인, 아니 할아버지!
en_us: sect leader, no, grandfather!

source: 죽여라!!
en_us: kill him!!!

source: 이 천정무희 이예린···
en_us: I, yerin lee, the heavenly dancer…

source: 이대로 가면 잡아먹인다!
en_us: I’ll get consumed at this rate!

source: 흥···
en_us: hmph…

source: 하지만 이번엔 결이 다르다, 동기를 알 수가 없어.
en_us: but this time is different. I can’t figure out the motive.

source: 어딨냐?
en_us: where is it?

source: 화
en_us: fw

source: 나선화 소속문파 흑익사홍문
en_us: seonhwa na, affiliated clan: great black clan

source: 본좌 또한 그렇게 생각한 적이 있었지.
en_us: that is what I thought too.

source: 무경대 1학년으로 특별 편입한 흑인사홍문 출신 나선화입니다~
en_us: my name is seonhwa na. I’m a first-year, special transfer student from the blackest deceit sect.

source: 띵
en_us: urgh

source: 야, 뭐하냐?
en_us: what are you doing?

source: 뿌드드
en_us: clutch

source: 누가 도와준다면 보답이라도 해줄 텐데ꞏꞏꞏ
en_us: if only someone would help me out, i’d reward them...

source: 누, 누구세요?
en_us: wh-who are you?!

source: 알려주세요.
en_us: so please tell me...

source: 촤앙
en_us: slice

source: 아이씨 누구야?!
en_us: dammit, who was that?!

source: 이, 이럴 수가,
en_us: n-no way.

source: 퍼{j}억
en_us: wham

source: 그대는 대체···!?
en_us: who is she…?!

source: 파다다닥
en_us: swish swish swish

source: 바른대로 말하지 않으면ꞏꞏꞏ
en_us: if you don’t give me an answer soon...

source: 놈을 쓰러뜨리려면 귀령파보다 더 강한 공격이 필요하다는ꞏꞏꞏ
en_us: I need something stronger than the ghostly spirit wave to take him down...

source: 떠{j}엉
en_us: boom

source: 귀령지보의 4성으로는 아직 무리였나···
en_us: I guess just having a four-star mastery of the treasure of the ghost king isn’t enough...
